# Лабораторная работа № 4. Контурный анализ.
#
# 1. Реализовать методы Канни, Собеля. Применить их к тестовому изображению.
#
# 2. Сравнить результаты.
#
# 3. Реализовать морфологические операции с использованием библиотеки OpenCV.
#
# 4. Осуществить устранение шумовых точек.
#
# 5. Провести замыкание контура на изображении.
#
# 6. Залить, получившийся контур.
#
# 7. Результрующую маску применить к исходному изображению и извлечь объект из исходного изображения.
#
# 8. Написать краткий отчет по проделанной работе с использованием Jupiter notebook.

import cv2

